---
type: SpecTypeId
namespace: Autodesk.Revit.DB
version: 2024
members: 151
tags: [revit-api, class]
---

# SpecTypeId

`Autodesk.Revit.DB.SpecTypeId` · Revit 2024 · 151 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Acceleration | 2021 | `public static ForgeTypeId Acceleration { get ; }` |
| Property | AirFlow | 2021 | `public static ForgeTypeId AirFlow { get ; }` |
| Property | AirFlowDensity | 2021 | `public static ForgeTypeId AirFlowDensity { get ; }` |
| Property | AirFlowDividedByCoolingLoad | 2021 | `public static ForgeTypeId AirFlowDividedByCoolingLoad { get ; }` |
| Property | AirFlowDividedByVolume | 2021 | `public static ForgeTypeId AirFlowDividedByVolume { get ; }` |
| Property | Angle | 2021 | `public static ForgeTypeId Angle { get ; }` |
| Property | AngularSpeed | 2021 | `public static ForgeTypeId AngularSpeed { get ; }` |
| Property | ApparentPower | 2021 | `public static ForgeTypeId ApparentPower { get ; }` |
| Property | ApparentPowerDensity | 2021 | `public static ForgeTypeId ApparentPowerDensity { get ; }` |
| Property | Area | 2021 | `public static ForgeTypeId Area { get ; }` |
| Property | AreaDividedByCoolingLoad | 2021 | `public static ForgeTypeId AreaDividedByCoolingLoad { get ; }` |
| Property | AreaDividedByHeatingLoad | 2021 | `public static ForgeTypeId AreaDividedByHeatingLoad { get ; }` |
| Property | AreaForce | 2021 | `public static ForgeTypeId AreaForce { get ; }` |
| Property | AreaForceScale | 2021 | `public static ForgeTypeId AreaForceScale { get ; }` |
| Property | AreaSpringCoefficient | 2021 | `public static ForgeTypeId AreaSpringCoefficient { get ; }` |
| Property | BarDiameter | 2021 | `public static ForgeTypeId BarDiameter { get ; }` |
| Property | CableTraySize | 2021 | `public static ForgeTypeId CableTraySize { get ; }` |
| Property | ColorTemperature | 2021 | `public static ForgeTypeId ColorTemperature { get ; }` |
| Property | ConduitSize | 2021 | `public static ForgeTypeId ConduitSize { get ; }` |
| Property | CoolingLoad | 2021 | `public static ForgeTypeId CoolingLoad { get ; }` |
| Property | CoolingLoadDividedByArea | 2021 | `public static ForgeTypeId CoolingLoadDividedByArea { get ; }` |
| Property | CoolingLoadDividedByVolume | 2021 | `public static ForgeTypeId CoolingLoadDividedByVolume { get ; }` |
| Property | CostPerArea | 2021 | `public static ForgeTypeId CostPerArea { get ; }` |
| Property | CostRateEnergy | 2021 | `public static ForgeTypeId CostRateEnergy { get ; }` |
| Property | CostRatePower | 2021 | `public static ForgeTypeId CostRatePower { get ; }` |
| Property | CrackWidth | 2021 | `public static ForgeTypeId CrackWidth { get ; }` |
| Property | CrossSection | 2021 | `public static ForgeTypeId CrossSection { get ; }` |
| Property | Currency | 2021 | `public static ForgeTypeId Currency { get ; }` |
| Property | Current | 2021 | `public static ForgeTypeId Current { get ; }` |
| Property | Custom | 2021 | `public static ForgeTypeId Custom { get ; }` |
| Property | DecimalSheetLength | 2021 | `public static ForgeTypeId DecimalSheetLength { get ; }` |
| Property | DemandFactor | 2021 | `public static ForgeTypeId DemandFactor { get ; }` |
| Property | Diffusivity | 2021 | `public static ForgeTypeId Diffusivity { get ; }` |
| Property | Displacement | 2021 | `public static ForgeTypeId Displacement { get ; }` |
| Property | Distance | 2021 | `public static ForgeTypeId Distance { get ; }` |
| Property | DuctInsulationThickness | 2021 | `public static ForgeTypeId DuctInsulationThickness { get ; }` |
| Property | DuctLiningThickness | 2021 | `public static ForgeTypeId DuctLiningThickness { get ; }` |
| Property | DuctSize | 2021 | `public static ForgeTypeId DuctSize { get ; }` |
| Property | Efficacy | 2021 | `public static ForgeTypeId Efficacy { get ; }` |
| Property | ElectricalFrequency | 2021 | `public static ForgeTypeId ElectricalFrequency { get ; }` |
| Property | ElectricalPotential | 2021 | `public static ForgeTypeId ElectricalPotential { get ; }` |
| Property | ElectricalPower | 2021 | `public static ForgeTypeId ElectricalPower { get ; }` |
| Property | ElectricalPowerDensity | 2021 | `public static ForgeTypeId ElectricalPowerDensity { get ; }` |
| Property | ElectricalResistivity | 2021 | `public static ForgeTypeId ElectricalResistivity { get ; }` |
| Property | ElectricalTemperature | 2021 | `public static ForgeTypeId ElectricalTemperature { get ; }` |
| Property | ElectricalTemperatureDifference | 2021 | `public static ForgeTypeId ElectricalTemperatureDifference { get ; }` |
| Property | Energy | 2021 | `public static ForgeTypeId Energy { get ; }` |
| Property | Factor | 2021 | `public static ForgeTypeId Factor { get ; }` |
| Property | Flow | 2021 | `public static ForgeTypeId Flow { get ; }` |
| Property | FlowPerPower | 2021 | `public static ForgeTypeId FlowPerPower { get ; }` |
| Property | Force | 2021 | `public static ForgeTypeId Force { get ; }` |
| Property | ForceScale | 2021 | `public static ForgeTypeId ForceScale { get ; }` |
| Property | HeatCapacityPerArea | 2021 | `public static ForgeTypeId HeatCapacityPerArea { get ; }` |
| Property | HeatGain | 2021 | `public static ForgeTypeId HeatGain { get ; }` |
| Property | HeatTransferCoefficient | 2021 | `public static ForgeTypeId HeatTransferCoefficient { get ; }` |
| Property | HeatingLoad | 2021 | `public static ForgeTypeId HeatingLoad { get ; }` |
| Property | HeatingLoadDividedByArea | 2021 | `public static ForgeTypeId HeatingLoadDividedByArea { get ; }` |
| Property | HeatingLoadDividedByVolume | 2021 | `public static ForgeTypeId HeatingLoadDividedByVolume { get ; }` |
| Property | HvacDensity | 2021 | `public static ForgeTypeId HvacDensity { get ; }` |
| Property | HvacEnergy | 2021 | `public static ForgeTypeId HvacEnergy { get ; }` |
| Property | HvacFriction | 2021 | `public static ForgeTypeId HvacFriction { get ; }` |
| Property | HvacMassPerTime | 2021 | `public static ForgeTypeId HvacMassPerTime { get ; }` |
| Property | HvacPower | 2021 | `public static ForgeTypeId HvacPower { get ; }` |
| Property | HvacPowerDensity | 2021 | `public static ForgeTypeId HvacPowerDensity { get ; }` |
| Property | HvacPressure | 2021 | `public static ForgeTypeId HvacPressure { get ; }` |
| Property | HvacRoughness | 2021 | `public static ForgeTypeId HvacRoughness { get ; }` |
| Property | HvacSlope | 2021 | `public static ForgeTypeId HvacSlope { get ; }` |
| Property | HvacTemperature | 2021 | `public static ForgeTypeId HvacTemperature { get ; }` |
| Property | HvacTemperatureDifference | 2021 | `public static ForgeTypeId HvacTemperatureDifference { get ; }` |
| Property | HvacVelocity | 2021 | `public static ForgeTypeId HvacVelocity { get ; }` |
| Property | HvacViscosity | 2021 | `public static ForgeTypeId HvacViscosity { get ; }` |
| Property | Illuminance | 2021 | `public static ForgeTypeId Illuminance { get ; }` |
| Property | IsothermalMoistureCapacity | 2021 | `public static ForgeTypeId IsothermalMoistureCapacity { get ; }` |
| Property | Length | 2021 | `public static ForgeTypeId Length { get ; }` |
| Property | LineSpringCoefficient | 2021 | `public static ForgeTypeId LineSpringCoefficient { get ; }` |
| Property | LinearForce | 2021 | `public static ForgeTypeId LinearForce { get ; }` |
| Property | LinearForceScale | 2021 | `public static ForgeTypeId LinearForceScale { get ; }` |
| Property | LinearMoment | 2021 | `public static ForgeTypeId LinearMoment { get ; }` |
| Property | LinearMomentScale | 2021 | `public static ForgeTypeId LinearMomentScale { get ; }` |
| Property | Luminance | 2021 | `public static ForgeTypeId Luminance { get ; }` |
| Property | LuminousFlux | 2021 | `public static ForgeTypeId LuminousFlux { get ; }` |
| Property | LuminousIntensity | 2021 | `public static ForgeTypeId LuminousIntensity { get ; }` |
| Property | Mass | 2021 | `public static ForgeTypeId Mass { get ; }` |
| Property | MassDensity | 2021 | `public static ForgeTypeId MassDensity { get ; }` |
| Property | MassPerUnitArea | 2021 | `public static ForgeTypeId MassPerUnitArea { get ; }` |
| Property | MassPerUnitLength | 2021 | `public static ForgeTypeId MassPerUnitLength { get ; }` |
| Property | Moment | 2021 | `public static ForgeTypeId Moment { get ; }` |
| Property | MomentOfInertia | 2021 | `public static ForgeTypeId MomentOfInertia { get ; }` |
| Property | MomentScale | 2021 | `public static ForgeTypeId MomentScale { get ; }` |
| Property | Number | 2021 | `public static ForgeTypeId Number { get ; }` |
| Property | Period | 2021 | `public static ForgeTypeId Period { get ; }` |
| Property | Permeability | 2021 | `public static ForgeTypeId Permeability { get ; }` |
| Property | PipeDimension | 2021 | `public static ForgeTypeId PipeDimension { get ; }` |
| Property | PipeInsulationThickness | 2021 | `public static ForgeTypeId PipeInsulationThickness { get ; }` |
| Property | PipeMassPerUnitLength | 2021 | `public static ForgeTypeId PipeMassPerUnitLength { get ; }` |
| Property | PipeSize | 2021 | `public static ForgeTypeId PipeSize { get ; }` |
| Property | PipingDensity | 2021 | `public static ForgeTypeId PipingDensity { get ; }` |
| Property | PipingFriction | 2021 | `public static ForgeTypeId PipingFriction { get ; }` |
| Property | PipingMass | 2021 | `public static ForgeTypeId PipingMass { get ; }` |
| Property | PipingMassPerTime | 2021 | `public static ForgeTypeId PipingMassPerTime { get ; }` |
| Property | PipingPressure | 2021 | `public static ForgeTypeId PipingPressure { get ; }` |
| Property | PipingRoughness | 2021 | `public static ForgeTypeId PipingRoughness { get ; }` |
| Property | PipingSlope | 2021 | `public static ForgeTypeId PipingSlope { get ; }` |
| Property | PipingTemperature | 2021 | `public static ForgeTypeId PipingTemperature { get ; }` |
| Property | PipingTemperatureDifference | 2021 | `public static ForgeTypeId PipingTemperatureDifference { get ; }` |
| Property | PipingVelocity | 2021 | `public static ForgeTypeId PipingVelocity { get ; }` |
| Property | PipingViscosity | 2021 | `public static ForgeTypeId PipingViscosity { get ; }` |
| Property | PipingVolume | 2021 | `public static ForgeTypeId PipingVolume { get ; }` |
| Property | PointSpringCoefficient | 2021 | `public static ForgeTypeId PointSpringCoefficient { get ; }` |
| Property | PowerPerFlow | 2021 | `public static ForgeTypeId PowerPerFlow { get ; }` |
| Property | PowerPerLength | 2021 | `public static ForgeTypeId PowerPerLength { get ; }` |
| Property | Pulsation | 2021 | `public static ForgeTypeId Pulsation { get ; }` |
| Property | ReinforcementArea | 2021 | `public static ForgeTypeId ReinforcementArea { get ; }` |
| Property | ReinforcementAreaPerUnitLength | 2021 | `public static ForgeTypeId ReinforcementAreaPerUnitLength { get ; }` |
| Property | ReinforcementCover | 2021 | `public static ForgeTypeId ReinforcementCover { get ; }` |
| Property | ReinforcementLength | 2021 | `public static ForgeTypeId ReinforcementLength { get ; }` |
| Property | ReinforcementSpacing | 2021 | `public static ForgeTypeId ReinforcementSpacing { get ; }` |
| Property | ReinforcementVolume | 2021 | `public static ForgeTypeId ReinforcementVolume { get ; }` |
| Property | Rotation | 2021 | `public static ForgeTypeId Rotation { get ; }` |
| Property | RotationAngle | 2021 | `public static ForgeTypeId RotationAngle { get ; }` |
| Property | RotationalLineSpringCoefficient | 2021 | `public static ForgeTypeId RotationalLineSpringCoefficient { get ; }` |
| Property | RotationalPointSpringCoefficient | 2021 | `public static ForgeTypeId RotationalPointSpringCoefficient { get ; }` |
| Property | SectionArea | 2021 | `public static ForgeTypeId SectionArea { get ; }` |
| Property | SectionDimension | 2021 | `public static ForgeTypeId SectionDimension { get ; }` |
| Property | SectionModulus | 2021 | `public static ForgeTypeId SectionModulus { get ; }` |
| Property | SectionProperty | 2021 | `public static ForgeTypeId SectionProperty { get ; }` |
| Property | SheetLength | 2021 | `public static ForgeTypeId SheetLength { get ; }` |
| Property | SiteAngle | 2021 | `public static ForgeTypeId SiteAngle { get ; }` |
| Property | Slope | 2021 | `public static ForgeTypeId Slope { get ; }` |
| Property | SpecificHeat | 2021 | `public static ForgeTypeId SpecificHeat { get ; }` |
| Property | SpecificHeatOfVaporization | 2021 | `public static ForgeTypeId SpecificHeatOfVaporization { get ; }` |
| Property | Speed | 2021 | `public static ForgeTypeId Speed { get ; }` |
| Property | Stationing | 2021 | `public static ForgeTypeId Stationing { get ; }` |
| Property | StationingInterval | 2021 | `public static ForgeTypeId StationingInterval { get ; }` |
| Property | Stress | 2021 | `public static ForgeTypeId Stress { get ; }` |
| Property | StructuralFrequency | 2021 | `public static ForgeTypeId StructuralFrequency { get ; }` |
| Property | StructuralVelocity | 2021 | `public static ForgeTypeId StructuralVelocity { get ; }` |
| Property | SurfaceAreaPerUnitLength | 2021 | `public static ForgeTypeId SurfaceAreaPerUnitLength { get ; }` |
| Property | ThermalConductivity | 2021 | `public static ForgeTypeId ThermalConductivity { get ; }` |
| Property | ThermalExpansionCoefficient | 2021 | `public static ForgeTypeId ThermalExpansionCoefficient { get ; }` |
| Property | ThermalGradientCoefficientForMoistureCapacity | 2021 | `public static ForgeTypeId ThermalGradientCoefficientForMoistureCapacity { get ; }` |
| Property | ThermalMass | 2021 | `public static ForgeTypeId ThermalMass { get ; }` |
| Property | ThermalResistance | 2021 | `public static ForgeTypeId ThermalResistance { get ; }` |
| Property | Time | 2021 | `public static ForgeTypeId Time { get ; }` |
| Property | UnitWeight | 2021 | `public static ForgeTypeId UnitWeight { get ; }` |
| Property | Volume | 2021 | `public static ForgeTypeId Volume { get ; }` |
| Property | WarpingConstant | 2021 | `public static ForgeTypeId WarpingConstant { get ; }` |
| Property | Wattage | 2021 | `public static ForgeTypeId Wattage { get ; }` |
| Property | Weight | 2021 | `public static ForgeTypeId Weight { get ; }` |
| Property | WeightPerUnitLength | 2021 | `public static ForgeTypeId WeightPerUnitLength { get ; }` |
| Property | WireDiameter | 2021 | `public static ForgeTypeId WireDiameter { get ; }` |